In [59]:
# Importing pandas as pd 
import pandas as pd

In [60]:
# 2. Create a DataFrame with three columns and three rows
df = pd.DataFrame({
    'Names': ['Medha', 'Keerthana', 'Harshitha','Karthik','Bhanu','Mahesh','Uma','Deepu','Ricky'],
    'Hobbies': ['Reading', 'Playing', 'Cooking','Guitar','Coding','Dancing','Gym','Cricket','Singing'],
    'City': ['Hyderabad', 'Hyderabad', 'USA','Hyderabad','Hyderabad','Manipur','Vizag','Guntur','Dallas']
})

df

       Names  Hobbies       City
0      Medha  Reading  Hyderabad
1  Keerthana  Playing  Hyderabad
2  Harshitha  Cooking        USA
3    Karthik   Guitar  Hyderabad
4      Bhanu   Coding  Hyderabad
5     Mahesh  Dancing    Manipur
6        Uma      Gym      Vizag
7      Deepu  Cricket     Guntur
8      Ricky  Singing     Dallas

In [61]:
# 3. view the head of the DataFrame
df.head()

       Names  Hobbies       City
0      Medha  Reading  Hyderabad
1  Keerthana  Playing  Hyderabad
2  Harshitha  Cooking        USA
3    Karthik   Guitar  Hyderabad
4      Bhanu   Coding  Hyderabad

In [62]:
# 4. view the index of the DataFrame
df.index

RangeIndex(start=0, stop=9, step=1)

In [63]:
# 5. Select and view only the first row of the DataFrame
df.iloc[0]

Names          Medha
Hobbies      Reading
City       Hyderabad
Name: 0, dtype: object

In [64]:
df.iloc[2:6]

       Names  Hobbies       City
2  Harshitha  Cooking        USA
3    Karthik   Guitar  Hyderabad
4      Bhanu   Coding  Hyderabad
5     Mahesh  Dancing    Manipur

In [65]:
# 6. select and view only the first column of the DataFrame
df['Names']

0        Medha
1    Keerthana
2    Harshitha
3      Karthik
4        Bhanu
5       Mahesh
6          Uma
7        Deepu
8        Ricky
Name: Names, dtype: object

In [66]:
# 7. create a DataFrame using list
df[['Names', 'Hobbies']]

       Names  Hobbies
0      Medha  Reading
1  Keerthana  Playing
2  Harshitha  Cooking
3    Karthik   Guitar
4      Bhanu   Coding
5     Mahesh  Dancing
6        Uma      Gym
7      Deepu  Cricket
8      Ricky  Singing

In [68]:
# 8. write the DataFrame to a new CSV file saved in your folder for this course
df.to_csv('/Users/medhareddy/Desktop/Interactive Data/Interactive_Data_Medha.csv', index=False)

 **What does the "write/render/evaluate" loop provide for creators of interactive data visualizations?**

*The "write/render/evaluate" loop facilitates rapid visualization experimentation. We can create the code, see the outcome right away, and then modify it according to the outcome of your observations. It is simpler to test out various concepts and make design adjustments without losing time thanks to this cycle. When you're creating and testing data visualizations, it's a great approach to quickly improve your work and receive immediate feedback.*

 **Why are dynamic, interactive data visualizations useful when communicating data?**

*Interactive, dynamic visualizations are awesome because they allow the viewer to independently examine the facts. Users can zoom in, filter, and examine elements that are important to them in interactive visualizations, as compared to static ones that only provide one viewpoint. This facilitates various individuals' readings of the data. Interactive components are particularly good at conveying information because they make the experience more interesting and can help consumers better absorb complex data.*

**Do you agree with Murray's claim that open-source tools that avoid proprietary software are best for publishing data visualization? In a few sentences, explain why you do or do not agree.**

*Yes, Murray makes a valid point. The advantage of open-source tools is that they facilitate more accessibility to your work. Regardless of the device or operating system being used, anyone with a web browser can watch your visualization when you use open-source tools. You don't have to be concerned about using costly software or about compatibility problems. Additionally, open-source tools promote community cooperation and advancements, increasing the diversity and accessibility of your work.*